# Angle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbolProfile..::..Angle Property
FamilySymbolProfile Class See Also
---
The angle of the rotation of the profile in radians.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Angle { get; set; }
```

Visual Basic
---
```text
Public Property Angle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Angle {
	double get ();
	void set (double value);
}
```

# See Also
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace